app/controllers/flores_controller.rb

  def index
    @flores = ""
    @flor = Flor.all
---
SELECT `flors`.* FROM `flors`

  def create
    #metodo para crear flores mandando nombre, url, descripcion, precio
    print params['nombre']
    @flores = Flor.new(nombre: params['nombre'], url: params['url'], descripcion: params['descripcion'], precio: params['precio'])
    @flores.save
---
INSERT INTO `flors` (`nombre`, `url`, `descripcion`, `precio`, `created_at`, `updated_at`) VALUES ('asas', 'https://www.enviodivino.com/media/catalog/product/cache/1/small_image/270x380/9df78eab33525d08d6e5fb8d27136e95/e/l/el_praga_900x640.jpg', 'es de africa', 12000, '2017-11-26 17:40:09', '2017-11-26 17:40:09')

  def edit
    #metodo para editar las flores solo como parametro el id de la flor
    @flor = Flor.find(params[:id])
    @flor.update_attributes(nombre: params['nombre'], descripcion: params['descripcion'])
---
SELECT  `flors`.* FROM `flors` WHERE `flors`.`id` = 9 LIMIT 1
UPDATE `flors` SET `descripcion` = NULL, `updated_at` = '2017-11-27 14:50:40' WHERE `flors`.`id` = 12

  def ordenar
    #metodo para acumular ventas de las flores pasando como parametro el id
    @flor = Flor.find(params[:id])
    @venta = Venta.new(id_flor: params[:id])
    @venta.save
---
SELECT  `flors`.* FROM `flors` WHERE `flors`.`id` = 9 LIMIT 1
INSERT INTO `venta` (`id_flor`, `created_at`, `updated_at`) VALUES (10, '2017-11-27 03:38:09', '2017-11-27 03:38:09')

  def destroy
    #metodo para eliminar flores con solo el id
    @flor = Flor.find(params[:id])
    @flor.destroy
---
SELECT  `flors`.* FROM `flors` WHERE `flors`.`id` = 9 LIMIT 1
DELETE FROM `flors` WHERE `flors`.`id` = 9