app/controllers/home_controller.rb

SELECT `flors`.* FROM `flors`
---
  def index
  	@flor = Flor.all